<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the current release version of LibreOffice Language Pack DE (dmg/app)</string>
	<key>Identifier</key>
	<string>com.github.rolfkocherhans.download.libreofficelanguagepackde</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LibreOffice Language Pack DE</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key> •••••••   URLTextSearcher Comment   ••••••• </key>
			<string>UrlTextSearcher starts here</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(?P&lt;DOWNLOAD_URL&gt;download.documentfoundation.org/libreoffice/stable/[\d\.]+/mac/x86_64/LibreOffice_(?P&lt;version&gt;[\d\.]+)_MacOS_x86-64_langpack_de.dmg)</string>
				<key>request_headers</key>
				<dict>
					<key>Accept-Language</key>
					<string>de-CH</string>
				</dict>
				<key>url</key>
				<string>https://www.libreoffice.org/download/libreoffice-fresh/?type=mac-x86_64</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key> •••••••   URLDownloader Comment   ••••••• </key>
			<string>URLDownloader starts here</string>
			<key>Arguments</key>
			<dict>
				<key>request_headers</key>
				<dict>
					<key>Accept-Language</key>
					<string>de-CH</string>
				</dict>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
	</array>
</dict>
</plist>
