<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Tivoli Storage Manager (dmg) from IBM.</string>
	<key>Identifier</key>
	<string>com.github.rolfkocherhans.download.new.TivoliStorageManager</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TivoliStorageManager</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>product_name</key>
				<string>TivoliStorageManager</string>
			</dict>
			<key>Processor</key>
			<string>TivoliStorageManagerURLProviderNew</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-version.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
	</array>
</dict>
</plist>
