<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the current release version of TivoliStorageManager (dmg/pkg)</string>
	<key>Identifier</key>
	<string>com.github.rolfkocherhans.download.tivolistoragemanager</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TivoliStorageManager</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key> •••••••   TivoliStorageManagerURLProvider Comment   ••••••• </key>
			<string>TivoliStorageManagerURLProvider starts here</string>
			<key>Arguments</key>
			<dict>
				<key>product_name</key>
				<string>TivoliStorageManager</string>
			</dict>
			<key>Processor</key>
			<string>TivoliStorageManagerURLProvider</string>
		</dict>
		<dict>
			<key> •••••••   URLDownloader Comment   ••••••• </key>
			<string>UrlDownloader starts here</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
				<key>url</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
	</array>
</dict>
</plist>
