<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Package the current release version of MacTeX (pkg)</string>
	<key>Identifier</key>
	<string>com.github.rolfkocherhans.pkg.mactex</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MacTeX</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rolfkocherhans.download.mactex</string>
	<key>Process</key>
	<array>
		<dict>
			<key> •••••••   PkgCopier Comment   ••••••• </key>
			<string>PkgCopier starts here</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>source_pkg</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
	</array>
</dict>
</plist>
