<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of SWITCHdrive</string>
	<key>Identifier</key>
	<string>com.github.rolfkocherhans.download.SWITCHdrive</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SWITCHdrive</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(https://misc.www.switch.ch/drive/SWITCHdrive-[\d.]+pkg)</string>
				<key>url</key>
				<string>https://help.switch.ch/drive/downloads/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
	</array>
</dict>
</plist>
