<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the current release version of Fetch (dmd/app)</string>
	<key>Identifier</key>
	<string>com.github.rolfkocherhans.pkg.fetch</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>http://getfetch8.com</string>
		<key>NAME</key>
		<string>Fetch</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key> •••••••   URLTextSearcher Comment   ••••••• </key>
			<string>UrlTextSearcher starts here</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(/Fetch_.*\.dmg)</string>
				<key>url</key>
				<string>http://fetchsoftworks.com</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key> •••••••   URLDownloader Comment   ••••••• </key>
			<string>UrlDownloader starts here</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
	</array>
</dict>
</plist>
