<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Package the current release version of Fetch (dmg/app)</string>
	<key>Identifier</key>
	<string>com.github.rolfkocherhans.pkg.fetch2</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Fetch</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rolfkocherhans.download.fetch</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/bash
serialnumber="%SERIALNUMBER%"
registrantname="%REGISTRANTNAME%"
				</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/conf.txt</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key> •••••••   AppPkgCreator Comment   ••••••• </key>
			<string>AppPkgCreator starts here</string>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
