<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Fetch from Fetch Softworks website and creates a Apple installer pkg.

Optional Values SERIALNUMBER and REGISTRANTNAME when both provided will 
add a fetch license agreement to 
/Library/Preferences/com.fetchsoftworks.Fetch.License.plist.

Set SERIALNUMBER to serial number provided in a Fetch license agreement.
Set REGISTRANTNAME to name used to register a Fetch license agreement.</string>
	<key>Identifier</key>
	<string>com.github.rolfkocherhans.pkg.fetch2</string>
	<key>Input</key>
	<dict>
		<key>BUNDLEID</key>
		<string>com.fetchsoftworks.Fetch</string>
		<key>NAME</key>
		<string>Fetch</string>
		<key>REGISTRANTNAME</key>
		<string></string>
		<key>SERIALNUMBER</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rolfkocherhans.download.fetch</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Fetch.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/build</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
				<key>source_path</key>
				<string>%pathname%/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dirname</key>
				<string>Scripts</string>
			</dict>
			<key>Processor</key>
			<string>FetchScriptsPath</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%dirpath%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/bash
serialnumber="%SERIALNUMBER%"
registrantname="%REGISTRANTNAME%"
</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/conf.txt</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%BUNDLEID%</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%pkgroot%</string>
					<key>scripts</key>
					<string>%RECIPE_CACHE_DIR%/Scripts</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
