<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the current release version of DeployStudio (dmg/pkg)</string>
	<key>Identifier</key>
	<string>com.github.rolfkocherhans.download.deploystudio</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DeployStudio</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key> •••••••   DeployStudioURLProvider Comment   ••••••• </key>
			<string>DeployStudioURLProvider starts here</string>
			<key>Arguments</key>
			<dict/>
			<key>Processor</key>
			<string>DeployStudioURLProvider</string>
		</dict>
		<dict>
			<key> •••••••   URLDownloader Comment   ••••••• </key>
			<string>UrlDownloader starts here</string>
			<key>Arguments</key>
			<dict/>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
	</array>
</dict>
</plist>
