<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Packages the installed version of application "Fenster Platzieren".</string>
	<key>Identifier</key>
	<string>com.github.rolfkocherhans.download.FensterPlatzieren</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Fenster Platzieren</string>
		<key>PATH</key>
		<string>/Applications/Utilities/%NAME%.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%PATH%</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%PATH%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
	</array>
</dict>
</plist>
