<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Finds latest Office 2011 update and downloads the disk image.
Set VERSION to a specific version number to download that version instead.
Set CULTURE_CODE to a different value to get a different localization. See
http://msdn.microsoft.com/en-us/library/ee825488(v=cs.20).aspx for a table of Culture Codes.

If you would like to use an undocumented HTTPS download, set DOWNLOAD_URL_SCHEME to https.
</string>
	<key>Identifier</key>
	<string>com.github.rolfkocherhans.download.Office2011Updates_de</string>
	<key>Input</key>
	<dict>
		<key>CULTURE_CODE</key>
		<string>0807</string>
		<key>DOWNLOAD_URL_SCHEME</key>
		<string>http</string>
		<key>NAME</key>
		<string>Office2011_update</string>
		<key>VERSION</key>
		<string>latest</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.firefox-rc-en_US</string>
</dict>
</plist>
