<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the current release version of Firefox German (dmg/app)</string>
	<key>Identifier</key>
	<string>com.github.rolfkocherhans.download.firefoxgerman</string>
	<key>Input</key>
	<dict>
		<key>LOCALE</key>
		<string>de</string>
		<key>NAME</key>
		<string>Firefox German</string>
		<key>RELEASE</key>
		<string>latest</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.firefox-rc-en_US</string>
</dict>
</plist>
