<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Firefox (German) dmg from the Mozilla.</string>
	<key>Identifier</key>
	<string>com.github.rolfkocherhans.download.Firefox_de</string>
	<key>Input</key>
	<dict>
		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<false/>
		<key>LOCALE</key>
		<string>de</string>
		<key>NAME</key>
		<string>Firefox</string>
		<key>RELEASE</key>
		<string>latest</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.firefox-rc-en_US</string>
</dict>
</plist>
