<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the current release version of R (pkg)</string>
	<key>Identifier</key>
	<string>com.github.rolfkocherhans.pkg.r</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>R</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key> •••••••   URLTextSearcher Comment   ••••••• </key>
			<string>UrlTextSearcher starts here</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(?P&lt;r_filename&gt;R-(?P&lt;r_version&gt;[0-9\.]+)\.pkg)</string>
				<key>url</key>
				<string>https://cloud.r-project.org/bin/macosx/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key> •••••••   URLDownloader Comment   ••••••• </key>
			<string>URLDownloader starts here</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://cloud.r-project.org/bin/macosx/%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key> •••••••   EndOfCheckPhase Comment   ••••••• </key>
			<string>EndOfCheckPhase starts here</string>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key> •••••••   Copier Comment   ••••••• </key>
			<string>Copier starts here</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%match%</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
	</array>
</dict>
</plist>
